# Для натурального n создать словарь индекс-значение,
# состоящий из элементов последовательности 3n + 1. 
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
n = int(input("Введите количество членов последовательности: "))
dict_numbers = {}
for i in range(1, n+1):
    dict_numbers[i] = 3*i+1
print(dict_numbers)

# Пользователь задаёт две строки. 
# Определить количество вхождений одной строки в другой.

def entrystrings(text1, text2):
    if len(text1) > len(text2):
        lenmin = len(text2)
        endindex = len(text1) - lenmin + 1
        textmin = text2
        textmax = text1
    
    else:
        lenmin = len(text1)
        endindex = len(text2) - lenmin + 1
        textmin = text1
        textmax = text2
    
    count = 0
    for i in range(0, endindex):
        if textmax[i:i+lenmin] == textmin:
            count +=1
    return count

    
text1 = input('Введите первую строку: ')
text2 = input('Введите вторую строку: ')

result = entrystrings(text1, text2)
if result == 0:
    print('Вхождения отсутствуют')
else:
   print('Количество вхождений: ', result)
   

# 1. Сформировать список из N членов последовательности.
#    Для N = 5: 1, -3, 9, -27, 81 и т.д.

n = int(input("Введите количество членов последовательности: "))
temp = 1
for i in range(1, n+1):
    print(temp)
    temp *=-3 


# Подсчитать сумму цифр в вещественном числе.

import random
randomNumber = (random.uniform(-100, 100))
randomNumber = round(randomNumber, 2)
print('Выбранное число: ', randomNumber)
randomNumber = str(randomNumber)
sumDigit = 0
for i in randomNumber:
    if i != "." and i != "-":
        sumDigit += int(i)
print('Сумма цифр числа: ', sumDigit)



# Написать программу получающую набор произведений чисел от 1 до N. 
# Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ]
N = int(input('Ведите показатель N : '))
if N == 0 :
    print("Введён 0, список пуст")
elif N == 1 :
    print("[1]")
else:
    list = []
    list.append(1)
    temp = 2
    for i in range(3, N + 2):
        list.append(temp)
        temp *= i
    print(list)